nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
#if 0
        gpio_pin_config_t HPGP_RESET_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };
        /* Initialize GPIO functionality on pin PIO0_13 (pin 70)  */
        GPIO_PinInit(GPIO, 0U, 13U, &HPGP_RESET_config);

        const uint32_t HPGP_RESET = (/* Pin is configured as PIO0_13 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				//OCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN13 (coords: 70) is configured as PIO0_13 */
        //IOCON_PinMuxSet(IOCON, 0U, 13U, HPGP_RESET);
#endif
        gpio_pin_config_t LED_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };
        /* Initialize GPIO functionality on pin PIO0_20 (pin 73)  */
        GPIO_PinInit(GPIO, 0U, 20U, &LED_config);
        /* Initialize GPIO functionality on pin PIO1_4 (pin 75)  */
        GPIO_PinInit(GPIO, 1U, 4U, &LED_config);

        const uint32_t LED = (/* Pin is configured as PIO0_20 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
        IOCON_PinMuxSet(IOCON, 0U, 20U, LED);
        /* PORT1 PIN4 (coords: 75) is configured as PIO1_4 */
        IOCON_PinMuxSet(IOCON, 1U, 4U, LED);

        /* PILOT_SW */
        GPIO_PinInit(GPIO, 1U, 9U, &LED_config);
        /* PORT1 PIN9 (coords: 25) is configured as PIO1_9 */
        IOCON_PinMuxSet(IOCON, 1U, 9U, LED);

        const uint32_t port0_pin28_config = (/* Pin is configured as PIO0_28 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* GFCI_INT: PORT0 PIN28 (coords: 66) is configured as PIO0_28 */
        IOCON_PinMuxSet(IOCON, 0U, 28U, port0_pin28_config);
        gpio_pin_config_t WAKEUP_config = {
        		.pinDirection = kGPIO_DigitalInput,
				.outputLogic = 0U
        };
        /* Initialize GPIO functionality on pin PIO0_28 (pin 66)  */
        GPIO_PinInit(GPIO, 0U, 28U, &WAKEUP_config);

        const uint32_t RELAY = (/* Pin is configured as PIO1_24 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);

        gpio_pin_config_t RELAY_ON_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };

        if(g_sigboardHWVer == EVSE_SIGBRD_1X)
        {

            /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
            IOCON_PinMuxSet(IOCON, 1U, 28U, RELAY);

            /* Initialize GPIO functionality on pin PIO1_28 (pin 72)  */
            GPIO_PinInit(GPIO, 1U, 28U, &RELAY_ON_config);

        }

        else if(g_sigboardHWVer == EVSE_SIGBRD_2X)
        {
            /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
            IOCON_PinMuxSet(IOCON, 1U, 29U, RELAY);

            /* Initialize GPIO functionality on pin PIO1_29 (pin 80)  */
            GPIO_PinInit(GPIO, 1U, 29U, &RELAY_ON_config);

        }

        /* PORT1 PIN4 (coords: 75) is configured as PIO1_4 */
        IOCON_PinMuxSet(IOCON, 0U, 24U, RELAY);

        gpio_pin_config_t RELAY_OFF_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 0U
        };

        /* Initialize GPIO functionality on pin PIO0_24 (pin 69)  */
        GPIO_PinInit(GPIO, 0U, 24U, &RELAY_OFF_config);

        IOCON_PinMuxSet(IOCON, 0U, 14U, gpio_ip_config);
        gpio_pin_config_t EM_STOP_config = {
        		.pinDirection = kGPIO_DigitalInput,
				.outputLogic = 0U
        };
       /* Initialize GPIO functionality on pin PIO0_14 (pin 71)  */
        GPIO_PinInit(GPIO, 0U, 14U, &EM_STOP_config);

        const uint32_t port0_pin29_config = (/* Pin is configured as FC0_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN29 (coords: 93) is configured as FC0_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 29U, port0_pin29_config);

#if 0
        const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN30 (coords: 95) is configured as FC0_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);
#endif

        /* LIN */
        const uint32_t port0_pin2_config = (/* Pin is configured as FC3_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN2 (coords: 81) is configured as FC3_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

