nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
        const uint32_t port0_pin3_config = (/* Pin is configured as FC3_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN3 (coords: 84) is configured as FC3_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);

        /* M_UART */
        const uint32_t port1_pin10_config = (/* Pin is configured as FC1_RXD */
        		IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN10 (coords: 39) is configured as FC1_RXD */
        IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);

        const uint32_t port1_pin11_config = (/* Pin is configured as FC1_TXD */
        		IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN11 (coords: 94) is configured as FC1_TXD */
        IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);

        const uint32_t port1_pin23_config = (/* Pin is configured as FC2_SCK */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* PORT1 PIN23 (coords: 49) is configured as FC2_SCK */
        IOCON_PinMuxSet(IOCON, 1U, 23U, port1_pin23_config);

        const uint32_t port1_pin24_config = (/* Pin is configured as FC2_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* PORT1 PIN24 (coords: 3) is configured as FC2_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 1U, 24U, port1_pin24_config);

        const uint32_t port1_pin25_config = (/* Pin is configured as FC2_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN25 (coords: 77) is configured as FC2_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 1U, 25U, port1_pin25_config);

        const uint32_t port1_pin26_config = (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN26 (coords: 68) is configured as FC2_CTS_SDA_SSEL0 */
        IOCON_PinMuxSet(IOCON, 1U, 26U, port1_pin26_config);

        const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN30 (coords: 95) is configured as FC0_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);

}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_PinStatus
 * Description   : Configures pin routing and optionally pin electrical features for getting the hardware version
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
uint8_t BOARD_PinStatus(void)
{
	uint8_t boardVer=0;
	uint8_t pin1_value, pin2_value, pin3_value = 0;

    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);


    const uint32_t gpio_ip_Config = (/* Pin is configured as PIO1_15,16,17 */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
											IOCON_PIO_MODE_PULLDOWN |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);

    /* PORT1 PIN15, PIN16, PIN17 is configured as PULL_DOWN */
    IOCON_PinMuxSet(IOCON, 1U, 15U, gpio_ip_Config);
    IOCON_PinMuxSet(IOCON, 1U, 16U, gpio_ip_Config);
    IOCON_PinMuxSet(IOCON, 1U, 17U, gpio_ip_Config);

    gpio_pin_config_t BoardVer_config = {
    		.pinDirection = kGPIO_DigitalInput,
			.outputLogic = 0U
    };
    /* Initialize GPIO functionality */
    GPIO_PinInit(GPIO, 1U, 15U, &BoardVer_config);
    GPIO_PinInit(GPIO, 1U, 16U, &BoardVer_config);
    GPIO_PinInit(GPIO, 1U, 17U, &BoardVer_config);

    /*Read Pin Values*/
    pin1_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 15U));
    pin2_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 16U));
    pin3_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 17U));

    boardVer = (pin3_value << 2) | (pin2_value << 1) | pin1_value;

    return boardVer;

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
